<a href="https://colab.research.google.com/github/darman1725/Data-Analyst-Myskill/blob/main/12.%20Working%20with%20Numpy%20and%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Popular packages in Python for data analysis is Pandas and Numpy.\
Pandas is used to manipulate dataframe (table-like object), while\
Numpy is used to evaluate numbers and statistics.

In [ ]:
# first, we import pandas and numpy

import pandas as pd
import numpy as np

# the purpose of aliasing is to simplify the writing

Now we will import data from Google Sheet to here.\
Just follow the steps below.

In [ ]:
# 1. authorizing google colab
from google.colab import auth
auth.authenticate_user()

# 2. credentials for google sheets
import gspread
from google.auth import default
creds, _ = default()

# 3. authotizing the connection
gc = gspread.authorize(creds)

# 4. connecting (use the spreadsheet name from your Gdrive)
worksheet = gc.open('MySkill DA 6 - Python 2 Data').sheet1

# 5. exporting data to get_all_values gives a list of rows.
rows = worksheet.get_all_values()

# 6. using pandas to convert to a DataFrame and render.
df = pd.DataFrame.from_records(rows)

# 7. creating columns name
df.columns = df.iloc[0]
df = df.iloc[1:]
df

,student id,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,10100,male,group C,some high school,standard,none,62,76,67
2,10191,female,group A,associate's degree,standard,completed,40,59,55
3,10319,female,group D,high school,standard,none,79,79,87
4,10729,male,group D,some college,free/reduced,none,60,62,58
5,10928,male,group D,some high school,standard,completed,54,64,64
...,...,...,...,...,...,...,...,...,...
996,99328,male,group D,associate's degree,free/reduced,completed,84,84,87
997,99607,male,group D,high school,standard,completed,67,69,65
998,99642,male,group E,bachelor's degree,standard,none,33,44,50
999,99754,female,group D,master's degree,standard,completed,51,63,66
1000,99767,male,group E,associate's degree,free/reduced,none,64,70,69

As you can see above, we successfully imported data from Google Sheet.

Now let's run the cell below to find the average of "math score" using **average()** function in Numpy.\
To call the column of a Pandas dataframe, let's say **df**, simply use\
df['column name'] (with quotes).

In [ ]:
np.average( df['math score'] )

TypeError: ignored

Get the error?\
Let's check the datatype of each column then using **.dtypes()** method.

In [ ]:
for col in df.columns:
  print(f"Data type of column {col} is {df[col].dtypes}")

Data type of column student id is object
Data type of column gender is object
Data type of column race/ethnicity is object
Data type of column parental level of education is object
Data type of column lunch is object
Data type of column test preparation course is object
Data type of column math score is object
Data type of column reading score is object
Data type of column writing score is object

Or we can also use **.info()** method.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   1000 non-null   object
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   object
 7   reading score                1000 non-null   object
 8   writing score                1000 non-null   object
dtypes: object(9)
memory usage: 70.4+ KB

In Pandas Dataframe, "object" data type is string.\
We can see that math score, reading score, and writing score are\
all assigned as object.\
They are string, that's why we can't do any mathematical operations to them.

So, let's assign them **float** data type using **.astype()** method.\
Remember to redeclarate the columns to apply the change.

In [ ]:
df['math score'] = df['math score'].astype(float)
df['reading score'] = df['reading score'].astype(float)
df['writing score'] = df['writing score'].astype(float)

Let's check the info again.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   1000 non-null   object
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   float64
 8   writing score                1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

Now those score columns are numeric!\
Let's evaluate the average again.

In [ ]:
print( np.average( df["math score"] ) )
print( np.average( df["reading score"] ) )
print( np.average( df["writing score"] ) )

66.453
69.038
67.699

In [ ]:
print( np.median( df["math score"] ) )
print( np.median( df["reading score"] ) )
print( np.median( df["writing score"] ) )

67.0
70.0
68.0

In [ ]:
np.histogram( df["math score"] )

(array([  2,   9,  29,  68, 156, 207, 183, 185, 114,  47]),
 array([ 13. ,  21.7,  30.4,  39.1,  47.8,  56.5,  65.2,  73.9,  82.6,
         91.3, 100. ]))

In [ ]:
df[ ['gender', 'lunch'] ].shape

(1000, 2)

# Data Preparation

When prepare the data, it's important to see what values are there\
in each column.\
For example, we want to see what genders are there in 'gender' column.

We can do this using **.unique** method.

In [ ]:
print( df['gender'].unique() )

['male' 'female' '']

There are empty string '' there, but looks like it is not assigned as null!\
If we go back to see df.info() again, there are 1000 rows in df and also\
1000 non null count of gender (and all other columns).

That's because when we import from spreadsheet (CSV, XLS, etc), null value\
will be written as empty string ''.\
Because there is no information to Pandas about this values, they are\
assigned as empty string instead of null.

If we want to assign those empty string as null, follow this step.

In [ ]:
df['gender'] = df['gender'].replace('', np.nan)

Let's print unique values of gender again and also df.info().

In [ ]:
print( df['gender'].unique() )

['male' 'female' nan]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   1000 non-null   object
 1   gender                       995 non-null    object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   float64
 8   writing score                1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

Now we can see that there are 5 missing values in gender column.

If we want to do that for the entire dataframe, simply do this.

In [ ]:
# numpy nan is null type

df = df.replace('', np.nan)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   997 non-null    object
 1   gender                       995 non-null    object
 2   race/ethnicity               994 non-null    object
 3   parental level of education  1000 non-null   object
 4   lunch                        994 non-null    object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   float64
 8   writing score                1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

Notice that there are 3 null student ids there.\
Without student ID, we can't identify the students.

So we decide to drop those records from the data.\
We can use **.dropna** method to do this.

In [ ]:
df.dropna(subset=['student id'], inplace = True)

# "inplace = True" is used to modify the original dataframe

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 997 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   997 non-null    object
 1   gender                       992 non-null    object
 2   race/ethnicity               991 non-null    object
 3   parental level of education  997 non-null    object
 4   lunch                        991 non-null    object
 5   test preparation course      997 non-null    object
 6   math score                   997 non-null    float64
 7   reading score                997 non-null    float64
 8   writing score                997 non-null    float64
dtypes: float64(3), object(6)
memory usage: 77.9+ KB

In [ ]:
# .dropna() without inplace = True argument
# it won't change the original dataframe

df.dropna(subset=['race/ethnicity'])

,student id,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,10100,male,group C,some high school,standard,none,62.0,76.0,67.0
2,10191,female,group A,associate's degree,standard,completed,40.0,59.0,55.0
3,10319,female,group D,high school,standard,none,79.0,79.0,87.0
4,10729,male,group D,some college,free/reduced,none,60.0,62.0,58.0
5,10928,male,group D,some high school,standard,completed,54.0,64.0,64.0
...,...,...,...,...,...,...,...,...,...
996,99328,male,group D,associate's degree,free/reduced,completed,84.0,84.0,87.0
997,99607,male,group D,high school,standard,completed,67.0,69.0,65.0
998,99642,male,group E,bachelor's degree,standard,none,33.0,44.0,50.0
999,99754,female,group D,master's degree,standard,completed,51.0,63.0,66.0
1000,99767,male,group E,associate's degree,free/reduced,none,64.0,70.0,69.0

Sometimes we will find duplicated rows in our data.\
To check them, we can use **.duplicated()** method.

In [ ]:
df.duplicated()

1       False
2       False
3       False
4       False
5       False
        ...
996     False
997     False
998     False
999     False
1000    False
Length: 997, dtype: bool

False means the rows are not duplicated, while True means the row\
are duplicated.

To get better view, simply run this.

In [ ]:
df[ df.duplicated() ]

,student id,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
130,21508,female,group A,bachelor's degree,standard,none,78.0,73.0,68.0
131,21508,female,group A,bachelor's degree,standard,none,78.0,73.0,68.0
469,53446,male,group B,high school,standard,completed,56.0,48.0,36.0
503,55844,male,group A,some college,free/reduced,none,77.0,80.0,72.0
819,82337,female,group D,associate's degree,free/reduced,none,66.0,81.0,73.0
932,92950,male,group D,some high school,standard,none,59.0,54.0,48.0
933,92950,male,group D,some high school,standard,none,59.0,54.0,48.0

If we want to remove those duplicates, use **drop_duplicates()** method.\
Don't forget to add "inplace = True" as argument to modify the dataframe.\
(or don't add it if you don't want to modify the original dataframe)

In [ ]:
df.drop_duplicates(inplace = True)

Now let's run the .duplicated() again.

In [ ]:
df[df.duplicated()]

Empty DataFrame
Columns: [student id, gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []

Voila! No more duplicated rows now.\
Let's see the .info() as well.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 990 entries, 1 to 1000
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student id                   990 non-null    object
 1   gender                       985 non-null    object
 2   race/ethnicity               984 non-null    object
 3   parental level of education  990 non-null    object
 4   lunch                        984 non-null    object
 5   test preparation course      990 non-null    object
 6   math score                   990 non-null    float64
 7   reading score                990 non-null    float64
 8   writing score                990 non-null    float64
dtypes: float64(3), object(6)
memory usage: 77.3+ KB

As you can see, we have less rows now since the duplicated rows have been dropped.